loadtest/jmeter/order-duplicate-callback-card-secret-flow.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Order Duplicate Callback Card Secret Flow" enabled="true">
      <stringProp name="TestPlan.comments">Send duplicate payment success callbacks for pending card-secret orders and record idempotency results.</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Duplicate Callback Users" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(THREADS,10)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(RAMP_UP,1)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Duplicate Callback CSV" enabled="true">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="filename">${__P(INPUT_CSV,loadtest-output/order-duplicate-callback-card-secret-input.csv)}</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <boolProp name="quotedData">true</boolProp>
          <boolProp name="recycle">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
          <boolProp name="stopThread">true</boolProp>
          <stringProp name="variableNames">runId,orderNo,externalTradeNo,paidAmountYuan,paymentProvider,expectedQuantity,duplicateIndex</stringProp>
        </CSVDataSet>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler" testname="Prepare Duplicate Callback Row" enabled="true">
          <stringProp name="cacheKey">order-duplicate-callback-card-secret-prepare</stringProp>
          <stringProp name="script"><![CDATA[
def provider = (vars.get('paymentProvider') ?: '').trim()
if (provider.isEmpty()) {
    provider = 'SIMULATED'
}
def amount = (vars.get('paidAmountYuan') ?: '').trim()
if (amount.isEmpty()) {
    amount = '0.00'
}
vars.put('callbackPaymentProvider', provider)
vars.put('callbackPaidAmountYuan', amount)
vars.put('callbackStartedAtMs', String.valueOf(System.currentTimeMillis()))
]]></stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
        </JSR223Sampler>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Duplicate Payment Callback Success" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{
  "orderNo": "${orderNo}",
  "externalTradeNo": "${externalTradeNo}",
  "paidAmountYuan": ${callbackPaidAmountYuan},
  "paymentProvider": "${callbackPaymentProvider}"
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${__P(HOST,localhost)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(PORT,8080)}</stringProp>
          <stringProp name="HTTPSampler.protocol">${__P(PROTOCOL,http)}</stringProp>
          <stringProp name="HTTPSampler.path">/shopping/api/payments/callback/success</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="HTTP 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Payment callback must be accepted.</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Business Code Received" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="code">ORDER_PAYMENT_CALLBACK_RECEIVED</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Callback API must return async received code.</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Write Duplicate Callback Result CSV" enabled="true">
            <stringProp name="cacheKey">order-duplicate-callback-card-secret-write-result</stringProp>
            <stringProp name="script"><![CDATA[
import groovy.json.JsonSlurper
import java.nio.charset.StandardCharsets
import java.nio.file.Files
import java.nio.file.Path
import java.nio.file.StandardOpenOption

def output = props.getProperty('RESULT_CSV', '')
if (!output) {
    return
}
def callbackNo = ''
def acceptedStatus = ''
def businessCode = ''
def responseBody = prev.getResponseDataAsString()
try {
    def json = new JsonSlurper().parseText(responseBody)
    businessCode = json?.code ?: ''
    callbackNo = json?.data?.callbackNo ?: ''
    acceptedStatus = json?.data?.status ?: ''
} catch (Throwable ignored) {
}
if (businessCode) {
    prev.setResponseMessage((prev.getResponseMessage() ?: '') + ' businessCode=' + businessCode)
}
if (prev.getResponseCode() != '200' || businessCode != 'ORDER_PAYMENT_CALLBACK_RECEIVED') {
    prev.setSuccessful(false)
}
def csv = Path.of(output)
def esc = { value ->
    def text = value == null ? '' : String.valueOf(value)
    '"' + text.replace('"', '""') + '"'
}
def line = [
    props.getProperty('RUN_ID', vars.get('runId') ?: 'local'),
    vars.get('orderNo'),
    vars.get('externalTradeNo'),
    vars.get('callbackPaidAmountYuan'),
    vars.get('callbackPaymentProvider'),
    vars.get('expectedQuantity'),
    vars.get('duplicateIndex'),
    callbackNo,
    acceptedStatus,
    businessCode,
    prev.getResponseCode(),
    String.valueOf(prev.isSuccessful()),
    responseBody,
    vars.get('callbackStartedAtMs')
].collect(esc).join(',') + '\n'
synchronized (props) {
    def parent = csv.getParent()
    if (parent != null) {
        Files.createDirectories(parent)
    }
    if (!Files.exists(csv)) {
        Files.writeString(csv, 'run_id,order_no,external_trade_no,paid_amount_yuan,payment_provider,expected_quantity,duplicate_index,callback_no,accepted_status,business_code,http_code,success,response_body,callback_started_at_ms\n', StandardCharsets.UTF_8, StandardOpenOption.CREATE, StandardOpenOption.APPEND)
    }
    Files.writeString(csv, line, StandardCharsets.UTF_8, StandardOpenOption.CREATE, StandardOpenOption.APPEND)
}
]]></stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>